In [1]:
import pandas as pd
from pandas import * 
import numpy as np

# Pandas Data Structures : Series and DataFrame

In pandas package, there are two data structures - series and dataframe. These structures are explained below in detail -

1. Series

It is a one-dimensional array. You can access individual elements of a series using position. In the example below, we are generating 5 random values.

In [3]:
s1 = pd.Series(np.random.random(5))
s1

0    0.249105
1    0.697166
2    0.372773
3    0.130235
4    0.448446
dtype: float64

In [4]:
s1[2] #call value using index

0.3727728707896548

In [5]:
s1[2:4]

2    0.372773
3    0.130235
dtype: float64

In [6]:
s1.values

array([0.2491051 , 0.69716613, 0.37277287, 0.13023523, 0.44844562])

In [7]:
s1.index

RangeIndex(start=0, stop=5, step=1)

2. DataFrame

It is a 2-dimensional data structure that can store data of different data types such as characters, integers, floating point values, factors. 
Those who are well-conversant with MS Excel, they can think of data frame as Excel Spreadsheet.

In [4]:
students = pd.DataFrame({'Names': ['John','Mary','Henry','Augustus','Kenny'],
                          'Marks' : [50,81,98,25,35]})
students

      Names  Marks
0      John     50
1      Mary     81
2     Henry     98
3  Augustus     25
4     Kenny     35

In [5]:
students.Names #this syntax will return a series

0        John
1        Mary
2       Henry
3    Augustus
4       Kenny
Name: Names, dtype: object

In [6]:
students.Marks

0    50
1    81
2    98
3    25
4    35
Name: Marks, dtype: int64

In [7]:
students.Names[1:4]

1        Mary
2       Henry
3    Augustus
Name: Names, dtype: object

In [8]:
students

      Names  Marks
0      John     50
1      Mary     81
2     Henry     98
3  Augustus     25
4     Kenny     35

In [9]:
#Use loc or iloc to select one or more rows or values:
#loc[] is used for selecting rows and columns by its label,here label means index for rows and feature names for columns.
#only in  loc indexing is not considering n-1
students.loc[0,"Names"]

'John'

In [10]:
#iloc[],here i stands for integer positions.
students.iloc[1,[0]]

Names    Mary
Name: 1, dtype: object

In [11]:
students['Names'].dtype  #to find the data type of particular column

dtype('O')

In [12]:
students['Marks'].dtype

dtype('int64')

In [13]:
students['Marks']=students['Marks'].astype(float)  #t change the data type

In [14]:
students['Marks'].dtype

dtype('float64')

In [15]:
students.shape  #To view the dimensions or shape of the data

(5, 2)

In [16]:
students.shape[0]   #axis 0 is for rows

5

In [17]:
students.shape[1]   #axis 1 is for column

2

To view only some of the rows

By default head( ) shows first 5 rows. If we want to see a specific number of rows we can mention it in the parenthesis. Similarly tail( ) function shows last 5 rows by default.

In [18]:
students.head(5)

      Names  Marks
0      John   50.0
1      Mary   81.0
2     Henry   98.0
3  Augustus   25.0
4     Kenny   35.0

In [19]:
students.head(3)

   Names  Marks
0   John   50.0
1   Mary   81.0
2  Henry   98.0

In [20]:
students.tail(2)

      Names  Marks
3  Augustus   25.0
4     Kenny   35.0

In [21]:
s = pd.Series(['dog','dog','cat','horse',1,3,6], dtype="category")    #Define Categorical Variable
s

0      dog
1      dog
2      cat
3    horse
4        1
5        3
6        6
dtype: category
Categories (6, object): [1, 3, 6, 'cat', 'dog', 'horse']

In [23]:
students.sample(axis = 1)

   Marks
0   50.0
1   81.0
2   98.0
3   25.0
4   35.0

In [24]:
students.sample(1)

      Names  Marks
3  Augustus   25.0

In [25]:
students

      Names  Marks
0      John   50.0
1      Mary   81.0
2     Henry   98.0
3  Augustus   25.0
4     Kenny   35.0

In [26]:
students.sum()

Names    JohnMaryHenryAugustusKenny
Marks                         289.0
dtype: object

In [27]:
students.Marks.sum()

289.0

In [28]:
students.Marks.min()

25.0

In [29]:
students.Marks.max()

98.0

In [30]:
students.Marks.mean()

57.8

In [31]:
students.Marks.median()

50.0

In [32]:
students.Marks.mode()

0    25.0
1    35.0
2    50.0
3    81.0
4    98.0
dtype: float64

In [33]:
data = pd.DataFrame({"A" : ["John","Mary","Julia","Kenny","Henry"], "B" : ["Libra","Capricorn","Aries","Scorpio","Aquarius"]})
data

       A          B
0   John      Libra
1   Mary  Capricorn
2  Julia      Aries
3  Kenny    Scorpio
4  Henry   Aquarius

In [34]:
s1 = pd.Series(["Names","Urvi","Simran"],[1,6,3])
s1

1     Names
6      Urvi
3    Simran
dtype: object

In [35]:
d = pd.DataFrame(s1)
d

        0
1   Names
6    Urvi
3  Simran

In [36]:
d

        0
1   Names
6    Urvi
3  Simran

In [37]:
data.columns = ['Names','Zodiac_sign']

In [38]:
data

   Names Zodiac_sign
0   John       Libra
1   Mary   Capricorn
2  Julia       Aries
3  Kenny     Scorpio
4  Henry    Aquarius

In [42]:
# to import csv file 
df = pd.read_csv('Dataset/pandas_tutorial_read.csv')

In [43]:
df

     2018-01-01 00:01:01;read;country_7;2458151261;SEO;North America
0     2018-01-01 00:03:20;read;country_7;2458151262;...
1     2018-01-01 00:04:01;read;country_7;2458151263;...
2     2018-01-01 00:04:02;read;country_7;2458151264;...
3     2018-01-01 00:05:03;read;country_8;2458151265;...
4     2018-01-01 00:05:42;read;country_6;2458151266;...
...                                                 ...
1789  2018-01-01 23:57:14;read;country_2;2458153051;...
1790  2018-01-01 23:58:33;read;country_8;2458153052;...
1791  2018-01-01 23:59:36;read;country_6;2458153053;...
1792  2018-01-01 23:59:36;read;country_7;2458153054;...
1793  2018-01-01 23:59:38;read;country_5;2458153055;...

[1794 rows x 1 columns]

In [ ]:
df1 = pd.read_csv('pandas_tutorial_read.csv',delimiter=";")
df1

In [ ]:
df2=df1.rename(columns={'2018-01-01 00:01:01':'Date&Time','country_7':'country','2458151261':'ID','North America':'Topic'})
df2

In [ ]:
df2.head()   #it will display the first five rows and all columns from the dataset

In [ ]:
df2.tail()    #it will display the last five rows and all columns from the dataset

In [ ]:
df2.sample(10)   # it will display randomly 10 rows and all columns from the dataset.

In [ ]:
df2.count()  #it will display the count of data in each column.

In [ ]:
df2.isnull().sum() #this will display the total count of null values from each column.

In [ ]:
df2['country'].unique()

In [ ]:
df2.shape[1]

In [ ]:
df2.groupby(['country']).mean()

In [41]:
zoo = pd.read_csv('Dataset/zoo.csv')
zoo

      animal  uniq_id  water_need
0   elephant     1001         500
1   elephant     1002         600
2   elephant     1003         550
3      tiger     1004         300
4      tiger     1005         320
5      tiger     1006         330
6      tiger     1007         290
7      tiger     1008         310
8      zebra     1009         200
9      zebra     1010         220
10     zebra     1011         240
11     zebra     1012         230
12     zebra     1013         220
13     zebra     1014         100
14     zebra     1015          80
15      lion     1016         420
16      lion     1017         600
17      lion     1018         500
18      lion     1019         390
19  kangaroo     1020         410
20  kangaroo     1021         430
21  kangaroo     1022         410

In [ ]:
zoo.shape

In [ ]:
zoo.describe()

In [ ]:
zoo.info()

In [ ]:
zoo.groupby('animal').mean() #it will print the data by grouping animal column together and taking mean of rest of the columns.

In [ ]:
zoo.groupby('animal').water_need.mean() #it will print the data by grouping animal column together and taking mean of water_need column.

In [ ]:
#we cab also create the new datset using dictionaries
zoo_eats1={'animal':['elephant','tiger','zebra','lion','kangaroo','giraffe'],'Food':['vegetable','meat','vegetables','meat','vegetables','vegetables']}

zoo_eats = pd.DataFrame(zoo_eats1)
zoo_eats

In [ ]:
zoo

In [ ]:
zoo_food=zoo.merge(zoo_eats)
zoo_food

In [ ]:
zoo_food_1 = zoo.merge(zoo_eats,how='outer')
zoo_food_1

In [ ]:
zoo.sort_values('water_need')   #sort values in ascending order

In [ ]:
zoo.sort_values(['water_need'], ascending=False).reset_index()    #sort values in desending order & reset_index for to reset index values

In [ ]:
zoo_food

In [ ]:
zoo_food_1.isnull().sum()   #checks for numm value in dataframe

In [ ]:
zoo_food_1.dropna()  #drops the row with 'NaN' values

In [ ]:
zoo_food_1.drop('uniq_id',axis=1)

In [ ]:
zoo_food_1.sort_values('water_need')

# Cleaning Data 
Replace
Drop
Concatenate

In [ ]:
data_1 = {'state' : ['VA', 'VA', 'VA', 'MD', 'MD'],
          'year' : [2012, 2013, 2014, 2014, 2015],
          'population' : [5.0, 5.1, 5.2, 4.0, 4.1]}
df_1 = DataFrame(data_1)
df_1

In [ ]:
#Replace all occurrences of a string with another string, in place (no copy):
df_1.replace('VA', 'VIRGINIA', inplace=True)
df_1

In [ ]:
#In a specified column, replace all occurrences of a string with another string, in place (no copy):
df_1.replace({'state' : { 'MD' : 'MARYLAND' }}, inplace=True)
df_1

In [ ]:
#Drop the 'population' column and return a copy of the DataFrame:
df_2 = df_1.drop('population', axis=1)
df_2

In [ ]:
#Concatenate two DataFrames:
data_2 = {'state' : ['NY', 'NY', 'NY', 'FL', 'FL'],
          'year' : [2012, 2013, 2014, 2014, 2015],
          'population' : [6.0, 6.1, 6.2, 3.0, 3.1]}
df_3 = DataFrame(data_2)
df_3

In [ ]:
df_4 = pd.concat([df_1, df_3])
df_4